Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71/atdf/ATSAMV71N20.atdf
        <module name="PWM" id="6343" version="X">
          <instance name="PWM0">
            <register-group address-space="base" name="PWM0" name-in-module="PWM" offset="0x40020000"/>
            <signals>
              <signal pad="PA10" function="B" group="PWMEXTRG" index="0"/>
              <signal pad="PA22" function="B" group="PWMEXTRG" index="1"/>
              <signal pad="PA9" function="C" group="PWMFI" index="0"/>
              <signal pad="PD8" function="B" group="PWMFI" index="1"/>
              <signal pad="PD9" function="B" group="PWMFI" index="2"/>
              <signal pad="PA0" function="A" group="PWMH" index="0"/>
              <signal pad="PA11" function="B" group="PWMH" index="0"/>
              <signal pad="PA23" function="B" group="PWMH" index="0"/>
              <signal pad="PB0" function="A" group="PWMH" index="0"/>
              <signal pad="PD11" function="B" group="PWMH" index="0"/>
              <signal pad="PD20" function="A" group="PWMH" index="0"/>
              <signal pad="PA2" function="A" group="PWMH" index="1"/>
              <signal pad="PA12" function="B" group="PWMH" index="1"/>
              <signal pad="PA24" function="B" group="PWMH" index="1"/>
              <signal pad="PB1" function="A" group="PWMH" index="1"/>
              <signal pad="PD21" function="A" group="PWMH" index="1"/>
              <signal pad="PA13" function="B" group="PWMH" index="2"/>
              <signal pad="PA25" function="B" group="PWMH" index="2"/>
              <signal pad="PB4" function="B" group="PWMH" index="2"/>
              <signal pad="PC19" function="B" group="PWMH" index="2"/>
              <signal pad="PD22" function="A" group="PWMH" index="2"/>
              <signal pad="PA7" function="B" group="PWMH" index="3"/>
              <signal pad="PA14" function="B" group="PWMH" index="3"/>
              <signal pad="PA17" function="C" group="PWMH" index="3"/>
              <signal pad="PC13" function="B" group="PWMH" index="3"/>
              <signal pad="PC21" function="B" group="PWMH" index="3"/>
              <signal pad="PD23" function="A" group="PWMH" index="3"/>
              <signal pad="PA1" function="A" group="PWML" index="0"/>
              <signal pad="PA19" function="B" group="PWML" index="0"/>
              <signal pad="PB5" function="B" group="PWML" index="0"/>
              <signal pad="PC0" function="B" group="PWML" index="0"/>
              <signal pad="PD10" function="B" group="PWML" index="0"/>
              <signal pad="PD24" function="A" group="PWML" index="0"/>
              <signal pad="PA20" function="B" group="PWML" index="1"/>
              <signal pad="PB12" function="A" group="PWML" index="1"/>
              <signal pad="PC1" function="B" group="PWML" index="1"/>
              <signal pad="PC18" function="B" group="PWML" index="1"/>
              <signal pad="PD25" function="A" group="PWML" index="1"/>
              <signal pad="PA16" function="C" group="PWML" index="2"/>
              <signal pad="PA30" function="A" group="PWML" index="2"/>
              <signal pad="PB13" function="A" group="PWML" index="2"/>
              <signal pad="PC2" function="B" group="PWML" index="2"/>
              <signal pad="PC20" function="B" group="PWML" index="2"/>
              <signal pad="PD26" function="A" group="PWML" index="2"/>
              <signal pad="PA15" function="C" group="PWML" index="3"/>
              <signal pad="PC3" function="B" group="PWML" index="3"/>
              <signal pad="PC15" function="B" group="PWML" index="3"/>
              <signal pad="PC22" function="B" group="PWML" index="3"/>
              <signal pad="PD27" function="A" group="PWML" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="13"/>
              <param name="INSTANCE_ID" value="31"/>
            </parameters>
          </instance>
          <instance name="PWM1">
            <register-group address-space="base" name="PWM1" name-in-module="PWM" offset="0x4005C000"/>
            <signals>
              <signal pad="PA30" function="B" group="PWMEXTRG" index="0"/>
              <signal pad="PA18" function="A" group="PWMEXTRG" index="1"/>
              <signal pad="PA21" function="C" group="PWMFI" index="0"/>
              <signal pad="PA26" function="D" group="PWMFI" index="1"/>
              <signal pad="PA28" function="D" group="PWMFI" index="2"/>
              <signal pad="PA12" function="C" group="PWMH" index="0"/>
              <signal pad="PD1" function="B" group="PWMH" index="0"/>
              <signal pad="PA14" function="C" group="PWMH" index="1"/>
              <signal pad="PD3" function="B" group="PWMH" index="1"/>
              <signal pad="PA31" function="D" group="PWMH" index="2"/>
              <signal pad="PD5" function="B" group="PWMH" index="2"/>
              <signal pad="PA8" function="A" group="PWMH" index="3"/>
              <signal pad="PD7" function="B" group="PWMH" index="3"/>
              <signal pad="PA11" function="C" group="PWML" index="0"/>
              <signal pad="PD0" function="B" group="PWML" index="0"/>
              <signal pad="PA13" function="C" group="PWML" index="1"/>
              <signal pad="PD2" function="B" group="PWML" index="1"/>
              <signal pad="PA23" function="D" group="PWML" index="2"/>
              <signal pad="PD4" function="B" group="PWML" index="2"/>
              <signal pad="PA5" function="A" group="PWML" index="3"/>
              <signal pad="PD6" function="B" group="PWML" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="39"/>
              <param name="INSTANCE_ID" value="60"/>
            </parameters>
          </instance>
        </module>
        <module name="QSPI" id="11171" version="I">
          <instance name="QSPI">
            <register-group address-space="base" name="QSPI" name-in-module="QSPI" offset="0x4007C000"/>
            <signals>
              <signal pad="PA11" function="A" group="QCS"/>
              <signal pad="PA13" function="A" group="QIO" index="0"/>
              <signal pad="PA12" function="A" group="QIO" index="1"/>
              <signal pad="PA17" function="A" group="QIO" index="2"/>
              <signal pad="PD31" function="A" group="QIO" index="3"/>
              <signal pad="PA14" function="A" group="QSCK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="DMAC_ID_TX" value="5"/>
              <param name="INSTANCE_ID" value="43"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="11009" version="J">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1800"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
