Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71/atdf/ATSAMV71N20.atdf
      <value-group caption="" name="ACC_MR__SELMINUS">
        <value caption="Select TS" name="TS" value="0x0"/>
        <value caption="Select VREFP" name="VREFP" value="0x1"/>
        <value caption="Select DAC0" name="DAC0" value="0x2"/>
        <value caption="Select DAC1" name="DAC1" value="0x3"/>
        <value caption="Select AFE0_AD0" name="AFE0_AD0" value="0x4"/>
        <value caption="Select AFE0_AD1" name="AFE0_AD1" value="0x5"/>
        <value caption="Select AFE0_AD2" name="AFE0_AD2" value="0x6"/>
        <value caption="Select AFE0_AD3" name="AFE0_AD3" value="0x7"/>
      </value-group>
      <value-group caption="" name="ACC_MR__SELPLUS">
        <value caption="Select AFE0_AD0" name="AFE0_AD0" value="0x0"/>
        <value caption="Select AFE0_AD1" name="AFE0_AD1" value="0x1"/>
        <value caption="Select AFE0_AD2" name="AFE0_AD2" value="0x2"/>
        <value caption="Select AFE0_AD3" name="AFE0_AD3" value="0x3"/>
        <value caption="Select AFE0_AD4" name="AFE0_AD4" value="0x4"/>
        <value caption="Select AFE0_AD5" name="AFE0_AD5" value="0x5"/>
        <value caption="Select AFE1_AD0" name="AFE1_AD0" value="0x6"/>
        <value caption="Select AFE1_AD1" name="AFE1_AD1" value="0x7"/>
      </value-group>
      <value-group caption="" name="ACC_MR__ACEN">
        <value caption="Analog comparator disabled." name="DIS" value="0"/>
        <value caption="Analog comparator enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__EDGETYP">
        <value caption="Only rising edge of comparator output" name="RISING" value="0x0"/>
        <value caption="Falling edge of comparator output" name="FALLING" value="0x1"/>
        <value caption="Any edge of comparator output" name="ANY" value="0x2"/>
      </value-group>
      <value-group caption="" name="ACC_MR__INV">
        <value caption="Analog comparator output is directly processed." name="DIS" value="0"/>
        <value caption="Analog comparator output is inverted prior to being processed." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__SELFS">
        <value caption="The CE flag is used to drive the FAULT output." name="CE" value="0"/>
        <value caption="The output of the analog comparator flag is used to drive the FAULT output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__FE">
        <value caption="The FAULT output is tied to 0." name="DIS" value="0"/>
        <value caption="The FAULT output is driven by the signal defined by SELFS." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_ACR__ISEL">
        <value caption="Low-power option." name="LOPW" value="0"/>
        <value caption="High-speed option." name="HISP" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x414343"/>
      </value-group>
    </module>
    <module name="AES" caption="Advanced Encryption Standard" id="6149" version="U">
      <register-group name="AES">
        <register caption="Control Register" name="AES_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
          <bitfield caption="Random Number Generator Seed Loading" mask="0x00010000" name="LOADSEED"/>
        </register>
        <register caption="Mode Register" name="AES_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER"/>
          <bitfield caption="GCM Automatic Tag Generation Enable" mask="0x00000002" name="GTAGEN"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000008" name="DUALBUFF" values="AES_MR__DUALBUFF"/>
          <bitfield caption="Processing Delay" mask="0x000000F0" name="PROCDLY"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="AES_MR__SMOD"/>
          <bitfield caption="Key Size" mask="0x00000C00" name="KEYSIZE" values="AES_MR__KEYSIZE"/>
          <bitfield caption="Operating Mode" mask="0x00007000" name="OPMOD" values="AES_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Cipher Feedback Data Size" mask="0x00070000" name="CFBS" values="AES_MR__CFBS"/>
          <bitfield caption="Countermeasure Key" mask="0x00F00000" name="CKEY" values="AES_MR__CKEY"/>
          <bitfield caption="Countermeasure Type 1" mask="0x01000000" name="CMTYP1" values="AES_MR__CMTYP1"/>
          <bitfield caption="Countermeasure Type 2" mask="0x02000000" name="CMTYP2" values="AES_MR__CMTYP2"/>
          <bitfield caption="Countermeasure Type 3" mask="0x04000000" name="CMTYP3" values="AES_MR__CMTYP3"/>
          <bitfield caption="Countermeasure Type 4" mask="0x08000000" name="CMTYP4" values="AES_MR__CMTYP4"/>
          <bitfield caption="Countermeasure Type 5" mask="0x10000000" name="CMTYP5" values="AES_MR__CMTYP5"/>
          <bitfield caption="Countermeasure Type 6" mask="0x20000000" name="CMTYP6" values="AES_MR__CMTYP6"/>
        </register>
        <register caption="Interrupt Enable Register" name="AES_IER" offset="0x10" rw="W" size="4" atomic-op="set:AES_IMR">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Enable" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Interrupt Disable Register" name="AES_IDR" offset="0x14" rw="W" size="4" atomic-op="clear:AES_IMR">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Disable" mask="0x00010000" name="TAGRDY"/>
        </register>
