Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71/atdf/ATSAMV71N20.atdf
      <value-group caption="" name="AFEC_EMR__SIGNMODE">
        <value caption="Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions." name="SE_UNSG_DF_SIGN" value="0x0"/>
        <value caption="Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions." name="SE_SIGN_DF_UNSG" value="0x1"/>
        <value caption="All channels: Unsigned conversions." name="ALL_UNSIGNED" value="0x2"/>
        <value caption="All channels: Signed conversions." name="ALL_SIGNED" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_TEMPMR__TEMPCMPMOD">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module name="CHIPID" caption="Chip Identifier" id="6417" version="ZC">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="Cortex-M7" name="SAMx7" value="0x0"/>
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="SAM V71" name="SAMV71" value="0x12"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module name="EFC" caption="Embedded Flash Controller" id="6450" version="Y">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
          <bitfield caption="Unique ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00010000" name="UECCELSB"/>
          <bitfield caption="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00020000" name="MECCELSB"/>
          <bitfield caption="Unique ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00040000" name="UECCEMSB"/>
          <bitfield caption="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00080000" name="MECCEMSB"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
        <register caption="EEFC Version Register" name="EEFC_VERSION" offset="0x14" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
