Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71/atdf/ATSAMV71N20.atdf
        <register caption="Host Pipe Clear Register (n = 0) 0" name="USBHS_HSTPIPICR" offset="0x560" rw="W" size="4" count="10" atomic-op="clear:USBHS_HSTPIPISR">
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Set Register (n = 0) 0" name="USBHS_HSTPIPIFR" offset="0x590" rw="W" size="4" count="10" atomic-op="set:USBHS_HSTPIPISR">
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 0" name="USBHS_HSTPIPIMR" offset="0x5C0" rw="R" size="4" count="10">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 0" name="USBHS_HSTPIPIER" offset="0x5F0" rw="W" size="4" count="10" atomic-op="set:USBHS_HSTPIPIMR">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 0" name="USBHS_HSTPIPIDR" offset="0x620" rw="W" size="4" count="10" atomic-op="clear:USBHS_HSTPIPIMR">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe IN Request Register (n = 0) 0" name="USBHS_HSTPIPINRQ" offset="0x650" rw="RW" size="4" count="10">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
